{
    "example_room": {
        "name": "Example Room Name",
        "description": "Description for 1st Entry.",
        "description2": "Description for Re-Entry",
        "inventory": ["sample1, sample2"]
    },
    "room1": {
        "name": "Hangar Bay",
        "description": "The vast Hangar Bay feels deserted, with the silent spacecrafts adding to the eerie quietude of solitude.",
        "description2": "Reentering the Hangar Bay, the smell of machinery and the sight of spacecrafts greet me again.",
        "inventory": ["K1"],
        "player_start": "True"
    },
    "room2": {
        "name": "Jail",
        "description": "The Jail's quietness is more pronounced in solitude, its cold bars casting eerie shadows in the dim light.",
        "description2": "The Jail's cold, barred confines feel just as unwelcoming as the first time.",
        "inventory": ["K8"]
    },
    "room3": {
        "name": "Bedroom",
        "description": "The Bedroom's coziness contrasts starkly with the silence and solitude of the ship, offering a lonely respite.",
        "description2": "Back in the Bedroom, its cozy ambiance and personal belongings provide a sense of comfort.",
        "inventory": ["K4", "K5"]
    },
    "room4": {
        "name": "Security",
        "description": "In the deserted Security room, the idle monitors and absence of activity highlight the solitude.",
        "description2": "The familiar buzz of monitors and the Security room's aura of vigilance envelope me once more.",
        "inventory": ["K6"]
    },
    "room5": {
        "name": "Control Room",
        "description": "The Control Room, usually bustling, now feels unnervingly quiet and empty, emphasizing the loneliness.",
        "description2": "Returning to the Control Room, the hum of high-tech equipment and strategic displays reignites a sense of command.",
        "inventory": []
    },
    "room6": {
        "name": "Hallway Two",
        "description": "Hallway Two's length is more noticeable in the quiet, with each step echoing in the deserted corridor.",
        "description2": "Walking through Hallway Two again, its length and the sound of echoing footsteps bring a familiar rhythm.",
        "inventory": []
    },
    "room7": {
        "name": "Hallway One",
        "description": "The desolation in Hallway One is palpable, with the absence of people making it feel longer and more isolated.",
        "description2": "Revisiting Hallway One, the walls still bear the marks and memories of past movements.",
        "inventory": ["K2", "K3"]
    },
    "room8": {
        "name": "Armory",
        "description": "The Armory's stillness is profound, the weapons and armor standing silent watch in the absence of people.",
        "description2": "The Armory, with its array of weapons and armor, feels just as formidable and secure as before.",
        "inventory": ["K9"]
    },
    "room9": {
        "name": "Sabotage",
        "description": "The Sabotage Room feels more menacing in solitude, its tools for chaos lying in wait in the quiet.",
        "description2": "Entering the Sabotage Room again, its air of secrecy and potential for chaos is palpable.",
        "inventory": ["K10"]
    },
    "room10": {
        "name": "Medbay",
        "description": "In the empty Medbay, the usual bustle of care is replaced by a silent, sterile stillness, underscoring the solitude.",
        "description2": "The Medbay, with its sterile scent and life-saving equipment, offers a reassuring sense of safety upon reentry.",
        "inventory": ["K7"]
    }
}
